# Direct Context 3DHandle Settings Get Color Method

Source: https://www.revitapidocs.com/2026/fc95a5ce-2169-b71f-f23f-21fbcfb0cb90.htm

---

| Direct Context 3DHandle Settings Get Color Method |
| --- |

Gets the color of the handle and the associated DirectContext3D graphics.
**Namespace:** Autodesk.Revit.DB.DirectContext3D
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public Color GetColor()
```

```
Public Function GetColor As Color
```

```
public:
Color^ GetColor()
```

```
member GetColor : unit -> Color
```

#### Return Value

Color
The color. See Also

#### Reference

DirectContext3DHandleSettings Class Autodesk.Revit.DB.DirectContext3D Namespace